Autodesk.Revit.UI.Events.ExecutedEventArgs.SetJournalData(System.Collections.Generic.IDictionary{System.String,System.String})
Sets the journal data associated to this command (on journal playback).
Remarks:
For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.
Since: 2017

Autodesk.Revit.UI.Events.ExecutedEventArgs.GetJournalData
Gets the journal data associated to this command (on journal playback).
Remarks:
For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.
Since: 2017

Autodesk.Revit.UI.Events.ExecutedEventArgs
The event arguments used by AddInCommandBinding's Executed event.
Since: 2013